---
kind: type
id: T:Autodesk.Revit.DB.FabricationRodInfo
source: html/b52fe314-2639-a697-cf97-b3e4824818f8.htm
---
# Autodesk.Revit.DB.FabricationRodInfo

The rod information of the fabrication part.

## Syntax (C#)
```csharp
public class FabricationRodInfo : IDisposable
```

## Remarks
A fabrication part may have one or more rods. The FabricationRodInfo stores the rod information of the fabrication part.